app/controllers/api/v1/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@yopmail.com"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@yopmail.com"], ["LIMIT", 1]]
SELECT  "user_roles".* FROM "user_roles" WHERE "user_roles"."role" = $1 ORDER BY "user_roles"."id" ASC LIMIT $2  [["role", 1], ["LIMIT", 1]]
INSERT INTO "users" ("email", "name", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "updated_at" = $1, "user_role_id" = $2 WHERE "users"."id" = $3  [["updated_at", "2021-03-22 09:46:47.330413"], ["user_role_id", 3], ["id", 2]]
---
	def register
		begin
			user = User.find_by_email(params[:user][:email]) if params[:user][:email].present?
	      raise "Email is already exist" if user.present?
	    user_role = UserRole.find_by(role: params[:user][:role]) if params[:user][:role]
    	raise "Your role is not valid" unless user_role.present?
	    user = User.create!(user_params)
	    user.update(is_admin: true) if params[:user][:role].to_i == 2

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@yopmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "device_id" = $2, "device_tpe" = $3 WHERE "users"."id" = $4  [["updated_at", "2021-03-22 10:06:01.119488"], ["device_id", "1"], ["device_tpe", "A"], ["id", 20]]
---
	def login
		begin
			user = User.find_by_email(params[:user][:email]) if params[:user][:email].present?
	    raise "Please enter valid Email ID" unless user.present?
	    raise "Password is incorrect" unless user.valid_password?(params[:user][:password])
	    if user.present?
		    token = JsonWebToken.encode(user_id: user.id)
				user.update_attributes!(device_id: params[:user][:device_id], device_tpe: params[:user][:device_type], logout: false)

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test12@yopmail.com"], ["LIMIT", 1]]
---
	def forgot_password
	  	begin
				raise "Enter your email" unless params[:user][:email].present?

UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["encrypted_password", "$2a$04$tvunlOh7H4J/EY1VIL0ZxOfgQNTZqJbMaYGCq5wpIgqBUaIrhMeH6"], ["updated_at", "2021-03-22 13:13:56.321728"], ["id", 73]]
---
	def change_password
		begin
			raise "Please enter old password" unless params[:user][:old_password].present?
			raise "Please enter old new password" unless params[:user][:new_password].present?
			raise "old password is incorrect" unless @current_api_user.valid_password?(params[:user][:old_password])
			@current_api_user.update(password: params[:user][:new_password])

UPDATE "users" SET "email" = $1, "image" = $2, "name" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["email", "test12@yopmail.com"], ["image", "705cebac1881a13e9b098ecbdc44ef72bd9c7bfc-1.jfif"], ["name", "Test2"], ["updated_at", "2020-07-16 11:01:47.264303"], ["id", 1]]
---
	def profile
	 @current_api_user.update(profile_params)

UPDATE "users" SET "updated_at" = $1, "image" = $2 WHERE "users"."id" = $3  [["updated_at", "2020-07-16 14:49:58.346679"], ["image", "705cebac1881a13e9b098ecbdc44ef72bd9c7bfc-1.jfif"], ["id", 1]]
---
	def update_image
		begin
		raise "Please choose Image File" unless params[:image].present?
		id =  ENV['AWS_ACCESS_KEY_ID']
		secret_key = ENV['AWS_SECRET_ACCESS_KEY']
		bucket_name = ENV['S3_BUCKET_NAME']
		s3 = Aws::S3::Resource.new(credentials: Aws::Credentials.new(id, secret_key),
		region: 'us-east-1')
		if @current_api_user.try(:image).present?
			image_url = @current_api_user.image.split("com/")[1]
			obj = s3.bucket(bucket_name).object(image_url)
			obj.delete
		end
		image_name = params[:image].original_filename
		obj = s3.bucket(bucket_name).object("users/images/#{@current_api_user.id}/#{image_name}")

		obj.upload_file(params[:image].path)
		@current_api_user.update(image: obj.public_url)