app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."reset_password_token" = $1 LIMIT $2  [["reset_password_token", "jhjkh"], ["LIMIT", 1]]
UPDATE "users" SET "encrypted_password" = $1, "reset_password_token" = $2, "reset_password_sent_at" = $3, "updated_at" = $4 WHERE "users"."id" = $5
---
  def edit_password
  	  token = params[:token]
      password = params[:user][:password]
      password_confirmation = params[:user][:password_confirmation]
    begin
      raise "confirm password can't be blank." if password_confirmation.blank?
      raise "Token is Invaild" unless token.present?
      @user = User.find_by_reset_password_token(token)
      raise "Token has been expired" if @user.nil?
      raise "Password and confirm password does not match." if (password != password_confirmation)
        @user.update_attributes(password: password)